Config/Catalogs/ШаблоныЗаполненияНПКвитанцииНаОплату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныЗаполненияНПКвитанцииНаОплату</Name>
			<Comment>Шаблоны текста «Назначения платежа» документа «Квитанция на оплату»</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасширенныйШаблон</Name>
					<Comment>Истина - шаблон представлен выражением для вычисляемого поля в СКД, Ложь - значениями в ТЧ Последовательность</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаШаблона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Последовательность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючУсловнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоДополнительноеПоле</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПутьКДанным</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПример</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПоля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ШаблоныЗаполненияНПКвитанцииНаОплату/Forms/ФормаВвода/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПлатежноРасчетныеДокументы.ИнициализироватьДоступныеПоля(Параметры.ОбъектМетаданных,ДоступныеПоля,,2);
	
	АдресДопПолей = "";
	
	Если Параметры.Свойство("ДополнительныеПоля",АдресДопПолей) Тогда
		
		Если ЭтоАдресВременногоХранилища(АдресДопПолей) Тогда
			
			ТаблицаИзХранилища = ПолучитьИзВременногоХранилища(АдресДопПолей);
			ДополнительныеПоля.Загрузить(ТаблицаИзХранилища);

			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДопПоля",ТаблицаИзХранилища);
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДопПоля.ИдентификаторПоля,
				|	ДопПоля.Представление
				|ПОМЕСТИТЬ ВР_ДопПоля
				|ИЗ
				|	&ДопПоля КАК ДопПоля
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВР_ДопПоля.ИдентификаторПоля,
				|	ВР_ДопПоля.Представление,
				|	ВР_ДопПоля.ИдентификаторПоля.ПолноеИмя КАК ПолноеИмя,
				|	ВР_ДопПоля.ИдентификаторПоля.Имя КАК Имя,
				|	ВР_ДопПоля.ИдентификаторПоля.ЗначениеПустойСсылки КАК ЗначениеПустойСсылки
				|ИЗ
				|	ВР_ДопПоля КАК ВР_ДопПоля";

			Результат = Запрос.Выполнить();

			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ПолноеИмя = ВыборкаДетальныеЗаписи.ПолноеИмя;
				
				ПозицияТочки = Найти(ПолноеИмя,".");
				ТипОбъекта = Лев(ПолноеИмя,ПозицияТочки-1);
				ИмяОбъекта = Сред(ПолноеИмя,ПозицияТочки+1);
				НоваяСтрока = ДоступныеПоляДопРеквизитов.ПолучитьЭлементы().Добавить();
				НоваяСтрока.Представление = ВыборкаДетальныеЗаписи.Представление;
				МассивТипов = Новый Массив();
				МассивТипов.Добавить(ТипЗнч(ВыборкаДетальныеЗаписи.ЗначениеПустойСсылки));
				НоваяСтрока.Тип = Новый ОписаниеТипов(МассивТипов);
				НоваяСтрока.Имя = ВыборкаДетальныеЗаписи.Имя;
				НоваяСтрока.ПутьКДанным = "ДопПолеШаблона_"+ВыборкаДетальныеЗаписи.Имя;

				ПлатежноРасчетныеДокументы.ИнициализироватьДоступныеПоля(ИмяОбъекта,НоваяСтрока,ТипОбъекта);	
				
			КонецЦикла;
			
			ДеревоДоступныеПоляДопРеквизитов = РеквизитФормыВЗначение("ДоступныеПоляДопРеквизитов");
			
			МассивСтрок = ДеревоДоступныеПоляДопРеквизитов.Строки.НайтиСтроки(Новый Структура("Таблица",Истина),Истина);
			
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				
				Попытка
					СтрокаМассива.Родитель.Строки.Удалить(СтрокаМассива);
				Исключение
					//Уже удалили исходную строку
				КонецПопытки;
				
			КонецЦикла;
			
			ЗначениеВРеквизитФормы(ДеревоДоступныеПоляДопРеквизитов,"ДоступныеПоляДопРеквизитов");
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоНоваяСтрока = Параметры.новаяСтрока;
	
	НомерСтроки = Параметры.НомерСтроки;
	
	Если Не Параметры.НоваяСтрока Тогда
		
		ЭтоПутьКДанным 			= Параметры.ЭтоПутьКДанным;
		ПредставлениеПример 	= Параметры.ПредставлениеПример;
		ПутьКДанным				= Параметры.Данные;
		ЭтоДополнительноеПоле 	= Параметры.ЭтоДополнительноеПоле;
		ИмяТаблицы				= Параметры.ИмяТаблицы;
		Формат					= Параметры.Формат;
		КлючУсловнойЧасти		= Параметры.КлючУсловнойЧасти;
		
		Если ЭтоПутьКДанным Тогда
			Если ЭтоДополнительноеПоле Тогда
				ТипЗаписи = 3
			Иначе
				ТипЗаписи = 1;
			КонецЕсли;
		ИначеЕсли Прав(ПредставлениеПример,1) = Символы.ПС Тогда
			ТипЗаписи = 2;
		Иначе	
			ТипЗаписи = 0;
		КонецЕсли;			
		
		Если ТипЗаписи = 1 Тогда 
			
			ПутьБезСсылки = Сред(ПутьКДанным,8);
			НайтиНужноеПоле(ПутьБезСсылки,ДоступныеПоля,"ДоступныеПоля");
			
		ИначеЕсли ТипЗаписи = 3 Тогда
			
			ПозицияТочки = Найти(ПутьКДанным,".");
			Если ПозицияТочки = 0 Тогда 
				НайтиНужноеПоле(ПутьКДанным,ДоступныеПоляДопРеквизитов,"ДоступныеПоляДопРеквизитов");
			Иначе
				ИмяДопПоля = Лев(ПутьКДанным,ПозицияТочки-1);
				Для Каждого СтрДерева Из ДоступныеПоляДопРеквизитов.ПолучитьЭлементы() Цикл
					Если СтрДерева.ПутьКДанным = ИмяДопПоля Тогда
						НайтиНужноеПоле(Сред(ПутьКДанным,ПозицияТочки+1),СтрДерева,"ДоступныеПоляДопРеквизитов");
						Прервать;
					КонецЕсли;					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если Имя = "Сумма НДС" Тогда
			
			Для Сч = 1 По СтрЧислоСтрок(Формат) Цикл
				Часть = СтрПолучитьСтроку(Формат, Сч);
				ПозРавно = Найти(Часть, "=");
				Если ПозРавно > 0 Тогда
					ИмяЧасти = Лев(Часть, ПозРавно - 1);
					Значение = Сред(Часть, ПозРавно + 1);
					
					Если ИмяЧасти = "Текст1" Тогда
						Текст1 = Значение
					ИначеЕсли ИмяЧасти = "Ставка" Тогда
						СтавкаФлажок = Истина
					ИначеЕсли ИмяЧасти = "Текст2" Тогда
						Текст2 = Значение
					ИначеЕсли ИмяЧасти = "Сумма" Тогда
						СуммаФлажок = Истина;
						ФорматСуммыНДС = Значение;
					ИначеЕсли ИмяЧасти = "ТекстБезНДС" Тогда
						ТекстБезНДСФлажок = Истина;
						ТекстБезНДС = Значение;
					КонецЕсли; 
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 
	УстановитьВидимостьСтраниц();
	
	УстановитьВидимостьПолей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЗаписиПриИзменении(Элемент)
	
	ЭтоДополнительноеПоле = Ложь;
	
	УстановитьВидимостьСтраниц()
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиДоступныеПоля

&НаКлиенте
Процедура ДоступныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не Контроль(Элементы.ДоступныеПоля.ТекущиеДанные) тогда
		Возврат;
	КонецЕсли;	
	ПредставлениеПример = "["+Элементы.ДоступныеПоля.ТекущиеДанные.Представление+"]";
	Тип 				= Элементы.ДоступныеПоля.ТекущиеДанные.Тип;
	ИмяТаблицы			= Элементы.ДоступныеПоля.ТекущиеДанные.ИмяТаблицы;
	ЭтоПутьКДанным		= Истина;
	ЭтоДополнительноеПоле = Ложь;
	ПутьКДанным			= "Ссылка."+Элементы.ДоступныеПоля.ТекущиеДанные.ПутьКДанным;
	Имя 				= Элементы.ДоступныеПоля.ТекущиеДанные.Имя;
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляДопРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не Контроль(Элементы.ДоступныеПоляДопРеквизитов.ТекущиеДанные) тогда
		Возврат;
	КонецЕсли;
	ТекДанные = Элементы.ДоступныеПоляДопРеквизитов.ТекущиеДанные;
	ТекРодитель = ТекДанные.ПолучитьРодителя();
	Если ТекРодитель <> Неопределено Тогда
		РодительРодителя = ТекРодитель;
		Пока РодительРодителя <> Неопределено Цикл
			ТекРодитель = РодительРодителя;
			РодительРодителя = РодительРодителя.ПолучитьРодителя();	
		КонецЦикла;
		ПутьКДаннымРодителя = ТекРодитель.ПутьКДанным+".";
	Иначе
		//нет родителя, это верхний уровень
		ПутьКДаннымРодителя = "";
	КонецЕсли;
	
	ПредставлениеПример = "["+ТекДанные.Представление+"]";
	Тип 				= ТекДанные.Тип;
	ИмяТаблицы			= ТекДанные.ИмяТаблицы;
	ЭтоПутьКДанным		= Истина;
	ЭтоДополнительноеПоле = Истина;
	ПутьКДанным			= ПутьКДаннымРодителя + Элементы.ДоступныеПоляДопРеквизитов.ТекущиеДанные.ПутьКДанным;
	Имя 				= ТекДанные.Имя;
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляДопРеквизитовПриАктивизацииСтроки(Элемент)
	ДоступностьПоля = Ложь;
	ТекДанные = Элементы.ДоступныеПоляДопРеквизитов.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.ПолучитьРодителя() = Неопределено Тогда
			ДоступностьПоля = Истина;
		КонецЕсли;
	КонецЕсли;
	Элементы.ДоступныеПоляДопРеквизитовУдалитьДопПоле.Доступность = ДоступностьПоля;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	Ошибка = ЗаписатьРеквизиты();
	ЭтаФорма.Модифицированность = Ложь;
	Если не Ошибка тогда
		ЭтаФорма.Закрыть();
	Конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборФормата(Команда)
	
	Конструктор = Новый КонструкторФорматнойСтроки;

	Конструктор.ДоступныеТипы	= Тип;
	
	Если Имя = "Сумма НДС" тогда
		
	    Конструктор.Текст	= ФорматСуммыНДС;
		
	Иначе
		
	    Конструктор.Текст	= Формат;
		
	КонецЕсли;	
	
	Конструктор.Показать(Новый ОписаниеОповещения("ВыборФорматаЗавершение", ЭтотОбъект, Новый Структура("Конструктор", Конструктор)));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДопПоле(Команда)
	
	ОткрытьФорму("Справочник.ШаблоныЗаполненияНПКвитанцииНаОплату.Форма.ФормаДобавленияДополнительногоПоля",,,,,, Новый ОписаниеОповещения("ДобавитьДопПолеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДопПоле(Команда)
	
	ТекДанные = Элементы.ДоступныеПоляДопРеквизитов.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекДанные.ПолучитьРодителя() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Представление = ТекДанные.Представление;
	ТекстВопроса = Нстр("ru='При удалении дополнительного поля, из шаблона будут удалены все ссылка на реквизиты удаляемго поля.
							|Удалить дополнительное поле """+Представление+"""?'");
							
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьДопПолеЗавершение", ЭтотОбъект, Новый Структура("Представление, ТекДанные", Представление, ТекДанные)), ТекстВопроса,РежимДиалогаВопрос.ОКОтмена,20,КодВозвратаДиалога.Отмена,"Удаление дополнительного поля.",КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ВыборФорматаЗавершение(Текст, ДополнительныеПараметры) Экспорт
    
    Конструктор = ДополнительныеПараметры.Конструктор;
    
    
    Если НЕ Текст = Неопределено Тогда
        
        Если Имя = "Сумма НДС" тогда
            
            ФорматСуммыНДС = Конструктор.Текст;
            
        Иначе
            
            Формат = Конструктор.Текст;
            
        КонецЕсли;	
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДопПолеЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если НЕ Результат = Неопределено Тогда
        ОбработатьДобавлениеДопПоля(Результат);		
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработатьДобавлениеДопПоля(РезультатВыбора)

	ИдентификаторПоля = РезультатВыбора.ИдентификаторПоля;
	
	НовоеПоле = ДополнительныеПоля.Добавить();
	НовоеПоле.ИдентификаторПоля = ИдентификаторПоля;
	НовоеПоле.Представление = РезультатВыбора.Представление;
	
	ПолноеИмя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторПоля,"ПолноеИмя");
	ПозицияТочки = Найти(ПолноеИмя,".");
	ТипОбъекта = Лев(ПолноеИмя,ПозицияТочки-1);
	ИмяОбъекта = Сред(ПолноеИмя,ПозицияТочки+1);
	НоваяСтрока = ДоступныеПоляДопРеквизитов.ПолучитьЭлементы().Добавить();
	НоваяСтрока.Представление = РезультатВыбора.Представление;
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(ТипЗнч(ИдентификаторПоля.ЗначениеПустойСсылки));
	НоваяСтрока.Тип = Новый ОписаниеТипов(МассивТипов);
	НоваяСтрока.Имя = ИдентификаторПоля.Имя;
	НоваяСтрока.ПутьКДанным = "ДопПолеШаблона_"+ИдентификаторПоля.Имя;

	ПлатежноРасчетныеДокументы.ИнициализироватьДоступныеПоля(ИмяОбъекта,НоваяСтрока,ТипОбъекта);	
	ДеревоДоступныеПоляДопРеквизитов = РеквизитФормыВЗначение("ДоступныеПоляДопРеквизитов");
	МассивСтрок = ДеревоДоступныеПоляДопРеквизитов.Строки.НайтиСтроки(Новый Структура("Таблица",Истина),Истина);
	Для Каждого СтрокаМассива Из МассивСтрок Цикл
		Попытка
			СтрокаМассива.Родитель.Строки.Удалить(СтрокаМассива);
		Исключение
			//Уже удалили исходную строку
		КонецПопытки;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДеревоДоступныеПоляДопРеквизитов,"ДоступныеПоляДопРеквизитов");

КонецПроцедуры

&НаКлиенте
Процедура УдалитьДопПолеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Представление 	= ДополнительныеПараметры.Представление;
    ТекДанные 		= ДополнительныеПараметры.ТекДанные;
    
    Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    КонецЕсли;
    
    УдалитьДополенительноеПолеСервер(Представление);
    
    ДоступныеПоляДопРеквизитов.ПолучитьЭлементы().Удалить(ТекДанные);

КонецПроцедуры

&НаСервере
Процедура УдалитьДополенительноеПолеСервер(Представление)
	УдаляемыеСтроки = ДополнительныеПоля.НайтиСтроки(Новый Структура("Представление",Представление));
	Если УдаляемыеСтроки.Количество()> 0 Тогда
		ДополнительныеПоля.Удалить(УдаляемыеСтроки[0]);
		УдаленоДопПоле = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ПолучитьСтрокуФорматаНДС()
	
	Результат = "";
	Если Текст1 <> "" Тогда
		Результат = Результат + Символы.ПС
			+ "Текст1=" + Текст1;
	КонецЕсли;
	Если СтавкаФлажок Тогда
		Результат = Результат + Символы.ПС
			+ "Ставка=";
	КонецЕсли; 
	Если Текст2 <> "" Тогда
		Результат = Результат + Символы.ПС
			+ "Текст2=" + Текст2;
	КонецЕсли;
	Если СуммаФлажок Тогда
		Результат = Результат + Символы.ПС
			+ "Сумма=" + ФорматСуммыНДС;
	КонецЕсли;
	Если ТекстБезНДСФлажок Тогда
		Результат = Результат + Символы.ПС
			+ "ТекстБезНДС=" + ТекстБезНДС;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьСтрокуФорматаНДС()

&НаКлиенте
Функция ЗаписатьРеквизиты()

	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("НомерСтроки",НомерСтроки);
	Если (ТипЗаписи = 0) или (ТипЗаписи = 2)  тогда
		СтруктураРезультата.Вставить("ЭтоПутьКДанным", Ложь);
		Если ТипЗаписи = 2 тогда
			ПредставлениеПример = Символы.ПС;
		КонецЕсли;	
	Иначе	
		СтруктураРезультата.Вставить("ЭтоПутьКДанным", Истина);
	КонецЕсли;	
	СтруктураРезультата.Вставить("Данные", ПутьКДанным);
	СтруктураРезультата.Вставить("ПредставлениеПример", ПредставлениеПример);
	СтруктураРезультата.Вставить("ЭтоДополнительноеПоле",ЭтоДополнительноеПоле);
	СтруктураРезультата.Вставить("ИмяТаблицы",ИмяТаблицы);
	СтруктураРезультата.Вставить("КлючУсловнойЧасти",КлючУсловнойЧасти);
	Если Имя = "Сумма НДС" тогда
		Формат = ПолучитьСтрокуФорматаНДС();
	КонецЕсли;	
	
	СтруктураРезультата.Вставить("АдресВХранилище",ПоместитьВХранилищеДополнительныеПоля());
	СтруктураРезультата.Вставить("УдаленоДопПоле",УдаленоДопПоле);
	
	СтруктураРезультата.Вставить("Формат",Формат);
	СтруктураРезультата.Вставить("ЭтоНоваяСтрока",ЭтоНоваяСтрока);
	Если (ТипЗаписи = 1) и не ЗначениеЗаполнено(Имя) тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбран реквизит документа'");
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли (ТипЗаписи = 0) 
		И ПредставлениеПример = "" тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Пустая строка'");
		Сообщение.Сообщить();
		Возврат Истина;
	Иначе
		Оповестить("ЭлементНазначенияПлатежаКвитанция", СтруктураРезультата);
	КонецЕсли;	
		
	Возврат Ложь;
КонецФункции // ИзменитьРеквизитыДокумента()

&НаСервере
Функция ПоместитьВХранилищеДополнительныеПоля()
	ТаблицаДопПолей = ДополнительныеПоля.Выгрузить();
	АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаДопПолей,УникальныйИдентификатор);
	Возврат АдресВХранилище;
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьСтраниц()
	Если ТипЗаписи = 0 Тогда
		Элементы.ВыборПользователя.ТекущаяСтраница = Элементы.ВводТекста;
	ИначеЕсли ТипЗаписи = 1 Тогда
		Элементы.ВыборПользователя.ТекущаяСтраница = Элементы.ВыборРеквизита;
		Элементы.СтраницыДоступныхПолей.ТекущаяСтраница = Элементы.ДоступныеПоляОбъекта;
	ИначеЕсли ТипЗаписи = 3 Тогда
		Элементы.ВыборПользователя.ТекущаяСтраница = Элементы.ВыборРеквизита;
		Элементы.СтраницыДоступныхПолей.ТекущаяСтраница = Элементы.ДополнительныеДоступныеПоля;
		ДоступныеПоляДопРеквизитовПриАктивизацииСтроки(Неопределено);		
	Иначе
		Элементы.ВыборПользователя.ТекущаяСтраница = Элементы.ПереводСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПолей()
	Если Элементы.ДоступныеПоля.ТекущиеДанные <> Неопределено тогда
		Элементы.ФорматированиеЗначения.Видимость 	= Тип.СодержитТип(Тип("Число")) или Тип.СодержитТип(Тип("Дата"));
		Если ВРЕГ(СокрЛП(Сред(ПутьКДанным,8))) = "СУММАНДС" Тогда
			Элементы.ФорматированиеЗначения.ТекущаяСтраница = Элементы.ВыборФорматаСуммыНДС;
		Иначе	
			Элементы.ФорматированиеЗначения.ТекущаяСтраница = Элементы.ЧислоДата;
		КонецЕсли;	
			
	Иначе
		Элементы.ФорматированиеЗначения.Видимость 	= ложь;
	КонецЕсли;	
КонецПРоцедуры

&НаСервере
Процедура НайтиНужноеПоле(ПутьБезСсылки,ПоискДоступныеПоля,ИмяЭлемента)
	Для каждого Узел  из ПоискДоступныеПоля.ПолучитьЭлементы() цикл
		Если Узел.ПутьКДанным = ПутьБезСсылки тогда
			Тип = Узел.Тип;
			Имя = Узел.Имя;
			Элементы[ИмяЭлемента].ТекущаяСтрока = Узел.ПолучитьИдентификатор();
			Возврат;
		КонецЕсли;	
		НайтиНужноеПоле(ПутьБезСсылки,Узел,ИмяЭлемента);
	КонецЦикла;	
КонецПРоцедуры	

&НаКлиенте
Функция Контроль(ТекущиеДанные) 
	Если ТекущиеДанные.Таблица и Найти(ТекущиеДанные.ПутьКДанным,".") = 0 тогда
		ТекстОшибки = НСтр("ru = 'Выбран реквизит документа табличная чать'");
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		Возврат Ложь	
	КонецЕсли;
	Возврат Истина;
КонецФункции	

#КонецОбласти
